print("ຍີນດີຕອນຮັບສູ່ຮ້ານ BorHu")

#ເກັບຂໍ້ມູນສິນຄ້າ
apple = 1000
banana = 2000

print("ທ່ານເລືອກຊື້ສິນຄ້າໃນຮ້ານເຮົາໄດ້ເລີຍ!")
print("ລາຍການສີນຄ້າພາຍໃນຮ້ານ:")
print("1. Apple ລາຄາ 1000 ກີບ")
print("2. banana ລາຄາ 2000 ກີບ")



print("ກະລຸນນາ ເລືອກລາຍການທີ່ຕ້ອງການຊື້:")
print("ກົດ 1 ສຳລັບ apple")
print("ກົດ 2 ສຳລັບ banana")
choi = str(input(":"))
print("ກະລຸນນາປ້ອນຕຳນວນເງີນຂອງທ່ານ:")
money = int(input(":"))

if choi == "1":
    if money < apple:
        print("ທ່ານສັ່ງຊື້ apple ລາຄາ 1000 ກີບ")
        print("ຍອດເງີນທີ່ທ່ານປ້ອນໜ້ອຍກວ່າ ລາຄາສິນຄ້າ ທ່ານຕ້ອງເພີ່ມເງີນອີກ:",apple-money)
    else:
        if money > apple:
            print("ທ່ານສັ່ງຊື້ apple ລາຄາ 1000 ກີບ")
            print("ຂອບໃຈ ທີ່ໃຊ້ບໍລິການຮ້ານ BorHu:",money - apple ,"ກີບ ແມ່ນເງີນທອນຂອງທ່ານ")
        else:
            print("ທ່ານສັ່ງຊື້ apple ລາຄາ 1000 ກີບ")
            print("ຂອບໃຈ ທີ່ໃຊ້ບໍລິການ ການສັ່ງຊື້ສຳເລັດ")
if choi == "2":
    if money < banana:
        print("ທ່ານສັ່ງຊື້ banana ລາຄາ 2000 ກີບ")
        print("ຍອດເງີນທີ່ທ່ານປ້ອນໜ້ອຍກວ່າ ລາຄາສິນຄ້າ ທ່ານຕ້ອງເພີ່ມເງີນອີກ:",money-banana)
    else:
        if money > apple:
            print("ທ່ານສັ່ງຊື້ banana ລາຄາ 2000 ກີບ")
            print("ຂອບໃຈ ທີ່ໃຊ້ບໍລິການຮ້ານ BorHu:",money - banana ,"ກີບ ແມ່ນເງີນທອນຂອງທ່ານ")
        else:
            print("ທ່ານສັ່ງຊື້ banana ລາຄາ 2000 ກີບ")
            print("ຂອບໃຈ ທີ່ໃຊ້ບໍລິການ ການສັ່ງຊື້ສຳເລັດ")

if choi !='1' and choi!='2':
    print("ລາຍການທີ່ທ່ານເລືອກແມ່ນບໍ່ມີໃນຮ້ານ BorHu ")
    print("ເຮົາຈະເພີ່ມສິນຄ້າໃນໄວໆນີ້")
    print("ຂອບໃຈ ທີ່ໃຊ້ບໍລິການ")